# #user settings##########################################################################################################
# #1)IP адрес вашего шлюза, асики будут найдены в этой же подсети
# ip_gateway = '192.168.0.1'
# #2)Для корректной работы телеграм бота необходим прокси сервер, просто гуглим по запросу "прокси листы" и выбираем любой
# ProxyServer = ""
# #3)Токен для вашего телеграм бота, получить его можно у официального бота @BotFather, следуйте инструкциям (запуск /start)
# telegram_bot_id = '921832076:AAH3omMltOvV8ehtDLcWiZEWAVmwT4-sQ900'
# #4)Если стоит 1 то в телегу поступают только сообщения об ошибках и перезагрузках, если 0 - хэшрейт по всем, если 2 то всё
# errors_only = 0
# #5)Введите логин от майнеров
# miner_login = 'root'
# #6)Введите пароль от майнеров
# miner_passw = 'root'
# #7)Укажите минимальный хэшрейт при котором асик отправляется на перезагрузку (по умолчанию 10Th\s)
# minimal_hashrate = 10000
# #8)Введите интервал сканирования в секундах (по умолчанию 1 час)
# interval_sec=3600
# #end of user settings###################################################################################################
